# Coefficient Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..Coefficient Property
Connector Class See Also
---
The coefficient of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Coefficient { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Coefficient As Double
	Get
```

Visual C++
---
```text
public:
property double Coefficient {
	double get ();
}
```

# Remarks
Instantaneous coefficient of this connector, calculated according to system.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This connector does not support flow calculation and associated properties. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace